In [2]:
import pandas as pd
import numpy as np

In [3]:
student=[[100,90,80],[70,60,90]]
pd.DataFrame(student,columns=['iq','marks','package'])
pd.DataFrame(student)

     0   1   2
0  100  90  80
1   70  60  90

In [4]:
d1={'iq':[100,70],'marks':[60,50],'package':[40,90]}
pd.DataFrame(d1)
pd.DataFrame({'iq':[100,70],'marks':[60,50],'package':[40,90]})

    iq  marks  package
0  100     60       40
1   70     50       90

In [63]:
df=pd.read_csv(r"D:\Data_Science\datasets\netflix\netflix_titles.csv")
df.shape
df.sample(3)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
5916,s5917,Movie,My Own Man,David Sampliner,David Sampliner,United States,"March 6, 2015",2015,TV-MA,82 min,Documentaries,When a man discovers he will be the father to ...
8511,s8512,Movie,The Social Network,David Fincher,"Jesse Eisenberg, Andrew Garfield, Justin Timbe...",United States,"April 1, 2020",2010,PG-13,121 min,Dramas,Director David Fincher's biographical drama ch...
8729,s8730,Movie,Where the Money Is,Marek Kanievska,"Paul Newman, Linda Fiorentino, Dermot Mulroney...","Germany, United States, United Kingdom, Canada","January 15, 2020",2000,PG-13,89 min,"Action & Adventure, Comedies, Dramas",Paul Newman proves he's still got prodigious a...

In [6]:
df.dtypes
type(df)

pandas.core.frame.DataFrame

In [7]:
df.index

RangeIndex(start=0, stop=8807, step=1)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [9]:
df.isnull().sum()
df.columns
#df.values

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

In [10]:
df.describe()

       release_year
count   8807.000000
mean    2014.180198
std        8.819312
min     1925.000000
25%     2013.000000
50%     2017.000000
75%     2019.000000
max     2021.000000

In [12]:
df.duplicated().sum()#total number of duuplicated rows

0

In [16]:
df.rename(columns={'show_id':'id'}).sample(2)

,id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
7195,s7196,Movie,Kidnapping Mr. Heineken,Daniel Alfredson,"Jim Sturgess, Sam Worthington, Ryan Kwanten, A...","Netherlands, Belgium, United Kingdom, United S...","September 8, 2017",2015,R,95 min,"Action & Adventure, Dramas, International Movies","When beer magnate Alfred ""Freddy"" Heineken is ..."
1893,s1894,TV Show,DreamWorks Happy Holidays from Madagascar,NaN,"Tom McGrath, Chris Miller, Christopher Knights...",United States,"October 2, 2020",2005,TV-PG,1 Season,"Kids' TV, TV Comedies",Madagascar goes wild with holiday spirit in th...

In [ ]:
#df.sum(axis=1) #coulmn wise sum else row wise
#df.min() .max() .var .std()  .mode() .product()  
print(df['director'].mode(),"   ",df['director'].value_counts().max())
df['director'].value_counts()

In [51]:
df.iloc[[1,2,3],:]

,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
show_id,,,,,,,,,,,
s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."

In [48]:
df.loc['s2']
df.loc[:'s5','type':'director']
df.loc[:'s5',['type','director']]

            type         director
show_id
s1         Movie  Kirsten Johnson
s2       TV Show              NaN
s3       TV Show  Julien Leclercq
s4       TV Show              NaN
s5       TV Show              NaN

In [38]:
df=df.set_index("show_id")

In [56]:
df[df.director=='Kirsten Johnson']
df[(df.type=='TV Show') & (df.director=='Julien Leclercq')]

,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
show_id,,,,,,,,,,,
s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...

In [57]:
df[(df.type=='TV Show')].director.value_counts()

director
Alastair Fothergill                  3
Rob Seidenglanz                      2
Hsu Fu-chun                          2
Iginio Straffi                       2
Shin Won-ho                          2
                                    ..
Juliana Vicente                      1
Chang Chin-jung, Chen Rong-hui       1
Thierry Demaizière, Alban Teurlai    1
Manolo Caro                          1
Michael Cumming                      1
Name: count, Length: 222, dtype: int64

In [64]:
df.title=df.title.astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   category
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: category(1), int64(1), object(10)
memory usage: 1.1+ MB

In [71]:
df.sort_values(['director'],na_position='last')
df['director_freq'] = df['director'].map(df['director'].value_counts())
#df['director_freq'] = df['director'].map(lambda x:x.value_counts())this is incorrect as i want to perform operation which depend on whole series not just x value
df.sort_values(by='director_freq', ascending=False, na_position='last',inplace=True)

In [74]:
df['director'].unique()

array(['Rajiv Chilaka', 'Raúl Campos, Jan Suter', 'Suhas Kadav', ...,
       'Franck Phelizon', 'Mozez Singh', nan], dtype=object)

In [78]:
df['director'].rank(ascending=False)

412     1646.0
411     1646.0
414     1646.0
415     1646.0
416     1646.0
         ...
8795       NaN
8796       NaN
8797       NaN
8800       NaN
8803       NaN
Name: director, Length: 8807, dtype: float64

In [80]:
#df.sort_index()
df.reset_index().sample(2)

,index,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,director_freq
8066,5413,s5414,TV Show,Gypsy,NaN,"Naomi Watts, Billy Crudup, Sophie Cookson, Kar...","United States, United Kingdom","June 30, 2017",2017,TV-MA,1 Season,TV Dramas,Therapist Jean Holloway develops dangerous and...,NaN
4803,1126,s1127,Movie,My Fair Lady,George Cukor,"Audrey Hepburn, Rex Harrison, Stanley Holloway...",United States,"April 1, 2021",1964,G,173 min,"Classic Movies, Music & Musicals",When a Cockney flower girl takes elocution les...,1.0

In [81]:
df.nunique()

show_id          8807
type                2
title            8807
director         4528
cast             7692
country           748
date_added       1767
release_year       74
rating             17
duration          220
listed_in         514
description      8775
director_freq      17
dtype: int64

In [84]:
df.notnull().sum()
df.isnull().sum()

show_id             0
type                0
title               0
director         2634
cast              825
country           831
date_added         10
release_year        0
rating              4
duration            3
listed_in           0
description         0
director_freq    2634
dtype: int64

In [86]:
print(df.dropna(how='all').shape,"  ",df.dropna().shape)

(8807, 13)    (5332, 13)

In [89]:
print(df.dropna(how='all',subset=['director','cast','country','date_added','rating','duration']).shape)

(8807, 13)

In [ ]:
#df.fillna("unknown") whereever null value is it fill it with unkown
df.fillna(method="ffill")
df.fillna(method="bfill")
#df.drop_duplicates(keep='first',subset=['director','cast']).sample(1)#already and logic

In [102]:
df.ffill()  # forward fill
df.bfill().sample(1)  # backward fill

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,director_freq
4071,s4072,Movie,Can't Help Falling in Love,Mae Czarina Cruz,"Kathryn Bernardo, Daniel Padilla, Matteo Guidi...",Philippines,"February 27, 2019",2017,TV-14,120 min,"Comedies, Dramas, International Movies",Gab is eager to tie the knot with her handsome...,7.0

In [ ]:
df.drop(index=[1,2])
df.drop(columns=['type'])

In [107]:
df[df['type'].isin(['Drama', 'Comedy'])]

Empty DataFrame
Columns: [show_id, type, title, director, cast, country, date_added, release_year, rating, duration, listed_in, description, director_freq]
Index: []

In [113]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [10, 20, 30]})

# Multiply each value by 2
df1.apply(lambda x: x*2,axis=1)#cover coomplete row first axis=1 or axis =0 cover one series first then another one by one

   A   B
0  2  20
1  4  40
2  6  60

In [ ]:
#df.corr()
#df[['math', 'physics']].corr()
#df.corr()['math'].drop('math')

In [117]:
df_copy = df.copy()
df_copy.sample(1)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,director_freq
665,s666,TV Show,Deadwind,NaN,"Pihla Viitala, Lauri Tilkanen, Jani Volanen, T...","Finland, Germany","June 19, 2021",2020,TV-MA,2 Seasons,"Crime TV Shows, International TV Shows, TV Dramas","Just months after a tragic loss, detective Sof...",NaN

In [118]:
df.nlargest(2, 'release_year')   # Top 2 scores
df.nsmallest(1, 'release_year')  # Lowest score

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,director_freq
4250,s4251,TV Show,Pioneers: First Women Filmmakers*,NaN,NaN,NaN,"December 30, 2018",1925,TV-14,1 Season,TV Shows,This collection restores films from women who ...,NaN